app/controllers/chats_controller.rb

SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = $1 ORDER BY "chats"."id" DESC LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
SELECT 1 AS one FROM "chats" WHERE "chats"."user_id" = $1 LIMIT $2  [["user_id", 1], ["LIMIT", 1]]
---
  def index
    @chats = Chat.none
    if current_user&.chats.any?
      redirect_to chat_url(current_user.chats.last)

INSERT INTO "chats" ("user_id", "history", "q_and_a", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["history", nil], ["q_and_a", "{}"], ["created_at", "2024-07-10 09:08:02.127385"], ["updated_at", "2024-07-10 09:08:02.127385"]]
---
  def create
    @chat = Chat.new(user_id: current_user.id)

    respond_to do |format|
      if @chat.save

UPDATE "chats" SET "q_and_a" = $1, "updated_at" = $2 WHERE "chats"."id" = $3  [["q_and_a", "{{hi,\"Hi! It's nice to meet you. Is there something I can help you with, or would you like to chat?\"}}"], ["updated_at", "2024-07-10 11:58:11.790233"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @chat.update(chat_params)

DELETE FROM "chats" WHERE "chats"."id" = $1  [["id", 1]]
---
  def destroy
    @chat.destroy

SELECT "chats".* FROM "chats" WHERE "chats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_chat
      @chat = Chat.find(params[:id])