app/views/layouts/application.html.erb

SELECT "chats".* FROM "chats" WHERE "chats"."user_id" = $1  [["user_id", 1]]
---
            <turbo-frame id="user-chats">
              <%= render partial: 'chats/chat_list', collection: current_user.chats.reverse if current_user.present? %>